[
    {   "username": "rmnpTest",
        "name": "Sky Pond",
        "description": "Hiking to Sky Pond in Colorado is a thrilling adventure in Rocky Mountain National Park. The trailhead begins at the Glacier Gorge Trailhead and covers approximately 8.4 miles round trip, with an elevation gain of about 1,750 feet. Hikers traverse through dense forests, rocky terrain, and alpine meadows, offering stunning views of towering peaks, including Longs Peak and Taylor Peak. Along the way, trekkers pass by picturesque alpine lakes such as Alberta Falls and The Loch, surrounded by breathtaking mountain scenery. As hikers ascend higher, they encounter Timberline Falls, a majestic waterfall cascading down a rocky cliff face. Beyond Timberline Falls lies Sky Pond, a pristine alpine lake nestled beneath sheer granite cliffs. The serene beauty of Sky Pond, surrounded by rugged peaks and lush vegetation, makes it a perfect spot for a rest and a scenic lunch break. Wildlife sightings, such as marmots, pika, and elk, are common along the trail. Hikers should come prepared with sturdy hiking boots, layers of clothing for changing weather conditions, plenty of water, and snacks. Due to the high elevation and rugged terrain, it's important to be in good physical condition and to start the hike early to avoid afternoon thunderstorms.",
        "length": "8.43 miles, out and back",
        "trailComments": " " 
    },
    {   "username": " ",
    "name": "Mt. Ida",
    "description": "Mount Ida stands at an elevation of 12,880 feet, providing stunning panoramic views of the surrounding alpine landscapes. The trailhead starts from Milner Pass on Trail Ridge Road, and the hike typically takes around 6-8 hours round trip, covering approximately 9 miles. Hikers traverse through subalpine meadows, dense forests, and rocky terrain, encountering diverse flora and fauna along the way, including elk, marmots, and various wildflowers. The final ascent to the summit involves a steep and rocky climb, rewarding trekkers with breathtaking vistas of nearby peaks, alpine lakes, and expansive valleys. Hikers should be well-prepared with sturdy hiking boots, layers of clothing for unpredictable weather, plenty of water, and snacks. Due to the high elevation and rugged terrain, it's essential to acclimate properly and be cautious of altitude sickness symptoms.",
    "length": "9.28 miles, out and back",
    "trailComments": " " 
},
{   "username": " ",
"name": "Flattop Mountain and Hallett Peak",
"description": "Mount Ida stands at an elevation of 12,880 feet, providing stunning panoramic views of the surrounding alpine landscapes. The trailhead starts from Milner Pass on Trail Ridge Road, and the hike typically takes around 6-8 hours round trip, covering approximately 9 miles. Hikers traverse through subalpine meadows, dense forests, and rocky terrain, encountering diverse flora and fauna along the way, including elk, marmots, and various wildflowers. The final ascent to the summit involves a steep and rocky climb, rewarding trekkers with breathtaking vistas of nearby peaks, alpine lakes, and expansive valleys. Hikers should be well-prepared with sturdy hiking boots, layers of clothing for unpredictable weather, plenty of water, and snacks. Due to the high elevation and rugged terrain, it's essential to acclimate properly and be cautious of altitude sickness symptoms.",
"length": "9.73 miles, out and back",
"trailComments": " "
}
]